'''
企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
20万到40万之间时，高于20万元的部分，可提成5%；
40万到60万之间时高于40万元的部分，可提成3%；
60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成.
提问：从键盘输入当月利润I，求应发放奖金总数？
'''
#print("please input the profit")
'''
p = int(input("please input the profit"))
if p<=100000:
    m = p*0.1
    print("the prize is %d "%m)
elif p>100000 and p<200000:
	m =(p-100000)*0.075+100000*0.1
	print("the prize is ",m)
elif p>=200000 and p<=400000:
	m = (p-200000)*0.05+(p-300000)*0.075+100000*0.1
	print("the prize is ",m)

'''
# -*- coding: UTF-8 -*-
i =int(input('净利润:'))
arr =[1000000,600000,400000,200000,100000,0]
#arr =[0,100000,200000,400000,600000,1000000]
rat =[0.01,0.015,0.03,0.05,0.075,0.1]
r =0
for idx in range(0,6):
	if i>arr[idx]:
		r+=(i-arr[idx])*rat[idx]
		print((i-arr[idx]) *rat[idx])
		i =arr[idx]
print(r)
