#--------------------------------------------
#要求：将一个正整数分解质因数；例如您输入90，分解打印90=233*5。
#1、首先当这个质数恰等于n的情况下，则说明分解质因数的过程已经结束，打印出即可。
#2、如果遇到n<>k，但n能被k整除的情况，则应打印出k的值。同时用n除以k的商，
# 作为新的正整数你n，之后再重复执行第一步的操作。
#3、如果n不能被k整除时，那么用k+1作为k的值，再来重复执行第一步的操作系统。
#2018-8-3
#---------------------------------------------
n = num =int(input('please input a number:\n'))

f=[]
for j in range(int(num/2)+1): #控制除的次数
    for i in range(2,n):  #控制除的因数
        t = n%i
        if t==0:
            f.append(i)
            n=n//i
            break
if len(f) ==0:
    print('该数字没有质因数')
else:
    f.append(n)
    f.sort()
    print('%d=%d'%(num, f[0]),end='')#这里不换行
    for i in range(1,len(f)):
        print('%d'%f[i],end='')