#---------------------------------------------------------------
#题目：有两个磁盘文件A和B,各存放一行字母,
# 要求把这两个文件中的信息合并(按字母顺序排列), 输出到一个新文件C中。
#2018-8-20
#---------------------------------------------------------------
f1 = open('E:\\叶盛\\研究生学习\\python\\100 例\\55\\A.txt','r')
a1 = f1.read()
f1.close()
f2 = open('E:\\叶盛\\研究生学习\\python\\100 例\\55\\B.txt','r')
a2 = f2.read()
f2.close()
with open('E:\\叶盛\\研究生学习\\python\\100 例\\55\\C.txt','w') as f:
    l = list(a1+a2)
    l.sort()
    s = ''
    s = s.join(l) #这里的目的是将list转换成str类型
    f.write(l)
