#--------------------------------------------
#题目:一辆卡车违反交通规则,撞人后逃跑.现场有三人目击事件,但都没有记住车号,
# 只记下车号的一些特征.甲说：牌照的前两位数字是相同的；
# 乙说：牌照的后两位数字是相同的,但与前两位不同；
# 丙是数学家,他说：四位的车号所构成的数字正好等于某一个整数的平方.
# 请根据以上线索求出车号.
#2018-9-4
#--------------------------------------------------
for n in range(32,100):
    i = n * n
    a = int(i / 1000)
    b = int(i % 1000 / 100)
    c = int(i % 1000 % 100 / 10)
    d = int(i % 1000 % 100 % 10)
    if a==b and c==d and a!=c:
        print('其车牌号为: %d'%i)
'''
from math import sqrt
for i in range(1,10):
    for j in range(1,10):
        number = 1000*i +100 *i +10 * j +j
        if sqrt(number) == int(sqrt(number)):
            print(number)
'''

